app/controllers/public_controller.rb

SELECT "resistors".* FROM "resistors" WHERE "resistors"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def index
         @resistors = Resistor.find(:all)